app/controllers/photos_controller.rb

  def index
      @photos = Photo.all
      @like = {}
      @photos.each do |photo|
          @vote = Vote.where(photo_id: photo.id).sum(:like)
---
SELECT "photos".* FROM "photos"
SELECT SUM("votes"."like") FROM "votes" WHERE "votes"."photo_id" = ?  [["photo_id", 1]]

  def create
    params[:photo][:category_id] = params[:category_id]
    params[:photo][:user_id] = current_user.id
    @photo = Photo.create(photos_params)
---
INSERT INTO "photos" ("user_id", "category_id", "name", "created_at", "updated_at", "photo") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 2], ["category_id", 3], ["name", "NASA"], ["created_at", "2017-12-04 18:26:12.405030"], ["updated_at", "2017-12-04 18:26:12.405030"], ["photo", "images.jpeg"]]

  def vote
    @photo = Photo.find(params[:id])
    @vote = Vote.where(user_id: current_user.id, photo_id: @photo.id).first
    if @vote == nil or @vote.like == 0
      @like = 1
      Vote.create(user_id: current_user.id, photo_id: @photo.id, like: @like)
    else
      @vote.update(like: @vote.like-1)
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "votes".* FROM "votes" WHERE "votes"."user_id" = ? AND "votes"."photo_id" = ? ORDER BY "votes"."id" ASC LIMIT ?  [["user_id", 2], ["photo_id", 1], ["LIMIT", 1]]
INSERT INTO "votes" ("user_id", "photo_id", "like", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 2], ["photo_id", 1], ["like", 1], ["created_at", "2017-12-04 19:25:56.646393"], ["updated_at", "2017-12-04 19:25:56.646393"]]
UPDATE "votes" SET "like" = ?, "updated_at" = ? WHERE "votes"."id" = ?  [["like", 0], ["updated_at", "2017-12-04 19:59:39.552484"], ["id", 3]]